<a href="#" id="hw"></a>
<div style="background: #000;
            color: #FFF;
            margin: 0px;
                padding: 10px 0px 20px 0px;
            text-align: center; 
                ">
    <h1 style="padding: 0px 0px 0px 0px;">Week 15 Lab</h1>
</div>

# Exercise 1

a) Create a dictionary with fake data and use it to create a dataframe

In [1]:
import pandas as pd
dictionary =         {
            "Animal": [
                "Cat",
                "Cat",
                "Dog",
                "Cat",
                "Cat",
                "Cat"
            ],
            "Name": ["Mowgli", "Melo", "Jenna", 
                     "Tigrito", "Paquito", "Cutie"],
            "Sex": ["Female", "Female", "female", 
                    "Male", "Male", "Male"],
            "Age": [3, 2, 4, 
                    7, 7, 10]
       }
df = pd.DataFrame(dictionary)

In [2]:
df

  Animal     Name     Sex  Age
0    Cat   Mowgli  Female    3
1    Cat     Melo  Female    2
2    Dog    Jenna  female    4
3    Cat  Tigrito    Male    7
4    Cat  Paquito    Male    7
5    Cat    Cutie    Male   10

b)Create a list of values and use it to create a series.

In [3]:
val_lst = ["Yellow","Green", "Blue", "Yellow"]
names = pd.Series(val_lst, name="colors")
names

0    Yellow
1     Green
2      Blue
3    Yellow
Name: colors, dtype: object

In [4]:
location = pd.Series(["Brooklyn", "Bronx", "Bronx"], name="Location")
location

0    Brooklyn
1       Bronx
2       Bronx
Name: Location, dtype: object

c) Using either the dataframe or the series above, output the count, mean and standard deviation of it.

In [5]:
#using the DataFrame.agg() method:
df.agg(
        {
            "Animal": ["count", "mean","std"],
            "Name": ["count", "mean","std"],
            "Sex" : ["count", "mean","std"],
            "Age" : ["count", "mean","std"]
        }
)

       Animal  Name  Sex       Age
count     6.0   6.0  6.0  6.000000
mean      NaN   NaN  NaN  5.500000
std       NaN   NaN  NaN  3.016621

In [6]:
#checking each one individually
df.count()

Animal    6
Name      6
Sex       6
Age       6
dtype: int64

In [7]:
df.mean()

Age    5.5
dtype: float64

In [8]:
df.std()

Age    3.016621
dtype: float64

# Exercise 2

For the next parts of today's lab we will be using the `grades.csv` file in `/datasets`.

In [9]:
# initial imports

import pandas as pd

grades = pd.read_csv("grades.csv")

a) Output the first 5 rows of the dataframe

In [10]:
grades.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

b) Output the last 5 rows of the dataframe

In [11]:
grades.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

c) What is the shape of this dataframe?

In [13]:
grades.shape

(1000, 8)

d) How many columns are there with no values? How much memory does this df use?

In [14]:
grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

e) Create a new column called "total score" that is the sum of the math, reading and writing score. Output the dataframe

In [15]:
grades["total score"] = grades["math score"] + grades["reading score"] + grades["writing score"]

In [16]:
grades.sort_values("total score", ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score
916,male,group E,bachelor's degree,standard,completed,100,100,100,300
458,female,group E,bachelor's degree,standard,none,100,100,100,300
962,female,group E,associate's degree,standard,none,100,100,100,300
114,female,group E,bachelor's degree,standard,completed,99,100,100,299
179,female,group D,some high school,standard,completed,97,100,100,297
...,...,...,...,...,...,...,...,...,...
76,male,group E,some high school,standard,none,30,26,22,78
327,male,group A,some college,free/reduced,none,28,23,19,70
596,male,group B,high school,free/reduced,none,30,24,15,69
980,female,group B,high school,free/reduced,none,8,24,23,55
59,female,group C,some high school,free/reduced,none,0,17,10,27

f) Create a new column called "average score" that is the average of the math, reading, and writing scores. Output the dataframe.

In [18]:
grades["average score"] = (grades["total score"])/3

In [19]:
grades.sort_values("average score", ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score,average score
916,male,group E,bachelor's degree,standard,completed,100,100,100,300,100.000000
458,female,group E,bachelor's degree,standard,none,100,100,100,300,100.000000
962,female,group E,associate's degree,standard,none,100,100,100,300,100.000000
114,female,group E,bachelor's degree,standard,completed,99,100,100,299,99.666667
179,female,group D,some high school,standard,completed,97,100,100,297,99.000000
...,...,...,...,...,...,...,...,...,...,...
76,male,group E,some high school,standard,none,30,26,22,78,26.000000
327,male,group A,some college,free/reduced,none,28,23,19,70,23.333333
596,male,group B,high school,free/reduced,none,30,24,15,69,23.000000
980,female,group B,high school,free/reduced,none,8,24,23,55,18.333333
59,female,group C,some high school,free/reduced,none,0,17,10,27,9.000000

g) What is the average `total score` for each gender? What is the average `avg score` for each gender?

In [20]:
#average total score by each gender
grades[["gender", "total score"]].groupby("gender").mean()

        total score
gender
female   208.708494
male     197.512448

In [21]:
#average total score by each gender
grades[["gender", "average score"]].groupby("gender").mean()

        average score
gender
female      69.569498
male        65.837483

h) What is the average math score for each category of lunch? What about reading, writing, total and avg score

In [35]:
grades[["lunch", "math score","reading score", "writing score", "total score", "average score"]].groupby("lunch").mean()

,math score,reading score,writing score,total score,average score
lunch,,,,,
free/reduced,58.921127,64.653521,63.022535,186.597183,62.199061
standard,70.034109,71.654264,70.823256,212.511628,70.837209

i) What is the descriptive statistics for each category of `parental level of education`? What about reading, writing, total and avg score

In [23]:
grades["parental level of education"].describe()

count             1000
unique               6
top       some college
freq               226
Name: parental level of education, dtype: object

In [24]:
grades[["reading score", "writing score", "total score", "average score"]].describe()

       reading score  writing score  total score  average score
count    1000.000000    1000.000000  1000.000000    1000.000000
mean       69.169000      68.054000   203.312000      67.770667
std        14.600192      15.195657    42.771978      14.257326
min        17.000000      10.000000    27.000000       9.000000
25%        59.000000      57.750000   175.000000      58.333333
50%        70.000000      69.000000   205.000000      68.333333
75%        79.000000      79.000000   233.000000      77.666667
max       100.000000     100.000000   300.000000     100.000000

j) What are the average scores (for all score columns) for each category of `test preparation course`?

In [25]:
grades[["test preparation course", "math score","reading score", "writing score", "total score", "average score"]].groupby("test preparation course").mean()

,math score,reading score,writing score,total score,average score
test preparation course,,,,,
completed,69.695531,73.893855,74.418994,218.008380,72.669460
none,64.077882,66.534268,64.504673,195.116822,65.038941

k) Output only the score columns

In [26]:
grades[["reading score", "writing score", "total score", "average score"]]

     reading score  writing score  total score  average score
0               72             74          218      72.666667
1               90             88          247      82.333333
2               95             93          278      92.666667
3               57             44          148      49.333333
4               78             75          229      76.333333
..             ...            ...          ...            ...
995             99             95          282      94.000000
996             55             55          172      57.333333
997             71             65          195      65.000000
998             78             77          223      74.333333
999             86             86          249      83.000000

[1000 rows x 4 columns]

l) What rows have `avg scores` lower than 80? What percent of the total is that? (try to calculate the last part programmatically)

In [27]:
#What rows have avg scores lower than 80
below_80 = grades[grades["average score"] < 80]
below_80

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score,average score
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333
5,female,group B,associate's degree,standard,none,71,83,78,232,77.333333
7,male,group B,some college,free/reduced,none,40,43,39,122,40.666667
...,...,...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74,208,69.333333
994,male,group A,high school,standard,none,63,63,62,188,62.666667
996,male,group C,high school,free/reduced,none,62,55,55,172,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,195,65.000000
998,female,group D,some college,standard,completed,68,78,77,223,74.333333

In [28]:
#What percent of the total is that
#total is 1000 rows. 802 of those rows have avg scores lower than 80
(below_80.shape[0]/grades.shape[0]) *100

80.2

m) What are the `avg score`, `gender` and `lunch` columns for all students with avg scores above 90. Sort it in descending order by `avg score`. Store it to a new dataframe and then output the new dataframe.

In [29]:
new_dataframe = grades.loc[grades["average score"] > 90, ["average score", "gender", "lunch"]].sort_values("average score", ascending=False) 
new_dataframe

     average score  gender         lunch
458     100.000000  female      standard
962     100.000000  female      standard
916     100.000000    male      standard
114      99.666667  female      standard
179      99.000000  female      standard
712      99.000000  female      standard
625      98.666667    male      standard
165      98.666667  female      standard
903      97.666667  female  free/reduced
685      97.666667  female      standard
149      97.666667    male  free/reduced
957      97.333333  female      standard
566      97.333333  female  free/reduced
594      97.000000  female      standard
717      97.000000  female      standard
855      96.666667  female      standard
970      96.333333  female      standard
546      96.333333  female      standard
451      96.333333  female      standard
886      96.000000  female      standard
106      95.666667  female      standard
403      95.666667  female      standard
995      94.000000  female      standard
381      94.000000    male      standard
623      94.000000    male      standard
263      94.000000  female      standard
864      93.666667    male      standard
979      93.333333  female      standard
377      93.333333  female  free/reduced
571      93.000000    male      standard
919      92.666667    male      standard
2        92.666667  female      standard
562      92.666667    male      standard
229      92.333333  female      standard
503      92.000000  female      standard
802      92.000000  female      standard
934      91.666667    male      standard
268      91.666667  female      standard
612      91.666667    male      standard
539      91.666667    male      standard
6        91.666667  female      standard
373      91.666667  female      standard
580      91.333333  female      standard
122      91.333333  female      standard
104      91.333333    male      standard
501      91.000000  female      standard
121      90.666667    male      standard
474      90.333333  female      standard
334      90.333333  female      standard
755      90.333333  female      standard

m) How many rows are in the new dataframe? What percent of the new dataframe are female? What percent receive free/reduced lunch?

In [30]:
#How many rows are in the new dataframe
new_dataframe.shape[0]

50

In [38]:
#What percent of the new dataframe are female= 72%
(new_dataframe[new_dataframe["gender"] == 'female'].shape[0]/new_dataframe.shape[0]) *100

72.0

In [40]:
#What percent receive free/reduced lunch = 8%
(new_dataframe[new_dataframe["lunch"] == 'free/reduced'].shape[0]/new_dataframe.shape[0]) *100

8.0

n) Using the original dataframe, what is the `avg score` for each of the `gender`, `lunch` and `parental education level` column combinations?

In [33]:
grades.groupby(["gender", "lunch", "parental level of education"])["average score"].mean()

gender  lunch         parental level of education
female  free/reduced  associate's degree             65.907407
                      bachelor's degree              71.060606
                      high school                    58.405405
                      master's degree                67.333333
                      some college                   65.378788
                      some high school               56.425926
        standard      associate's degree             73.470833
                      bachelor's degree              76.609756
                      high school                    68.865497
                      master's degree                77.666667
                      some college                   74.346847
                      some high school               71.545455
male    free/reduced  associate's degree             65.008130
                      bachelor's degree              63.045455
                      high school                    56.222222
                      master's degree                66.800000
                      some college                   59.942857
                      some high school               58.373333
        standard      associate's degree             69.671795
                      bachelor's degree              72.595960
                      high school                    64.135266
                      master's degree                78.692308
                      some college                   68.484018
                      some high school               67.121693
Name: average score, dtype: float64

o) Sort the original dataframe by `gender` and `lunch` in descending order

In [34]:
grades.sort_values(["gender", "lunch"], ascending=False)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score,average score
4,male,group C,some college,standard,none,76,78,75,229,76.333333
10,male,group C,associate's degree,standard,none,58,54,52,164,54.666667
11,male,group D,associate's degree,standard,none,40,52,43,135,45.000000
13,male,group A,some college,standard,completed,78,72,70,220,73.333333
16,male,group C,high school,standard,none,88,89,86,263,87.666667
...,...,...,...,...,...,...,...,...,...,...
989,female,group D,some college,free/reduced,completed,67,86,83,236,78.666667
992,female,group D,associate's degree,free/reduced,none,55,76,76,207,69.000000
993,female,group D,bachelor's degree,free/reduced,none,62,72,74,208,69.333333
997,female,group C,high school,free/reduced,completed,59,71,65,195,65.000000
999,female,group D,some college,free/reduced,none,77,86,86,249,83.000000

p) Based on your exercises above, what sort of inferences can you make so far? What would you want to look further into? What factor seems to affect `avg` score the most? Explain your answer.

It seems that gender directly affects the average score the most. Of the top 50 students- 72% were female. Another fator seems to be lunch. Of the top 50 students- 92% had standard lunch.

I will like to create more intervals and separate the data into multiple databses according to grade. Perhaps do similar calculations on these intervals to see if we see the same patterns with gender and lunch.